def number_to_words(num):
    ons = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    teen = ['десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    dec = ['двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят','восемьдесят','девяносто']
    if len(str(num)) == 1:
        return ons[num-1]
    elif str(num)[0] == '1':
        return teen[num -10]
    elif len(str(num)) == 2:
        if str(num)[1] == '0':
            return dec[int(str(num)[0]) - 2]
        return dec[int(str(num)[0]) - 2] + ' ' + ons[int(str(num)[1]) - 1]
n = int(input())
print(number_to_words(n))